blog/2021/07/default-drop-ipv6-self-inflicted-pain/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-01 Thu 05:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Debugging with Default Drop Firewall Policies and IPv6</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="A rambling in self-inflicted suffering with Java, Emacs, DAP, and Firewalls!"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Emacs Debugging with Default Drop Firewall Policies and IPv6</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c354f8">Confluence of Issues</a></li>
<li><a href="#org434eed0">IPv6+4</a></li>
<li><a href="#org9e0a6da">TL;DR:</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Debugging <a href="https://www.oracle.com/java/">Java</a> programs in <a href="https://www.gnu.org/software/emacs/">Emacs</a> has been a goal and overall feature I have
wanted for some time.  However, every time I've reached for it, <code>dap-java-debug</code>
demonstrated an unbearably slow startup.  So much so, that it was often faster
and more productive to launch <a href="https://www.jetbrains.com/idea/">IntelliJ</a>, fight <a href="https://nixos.org/">Nix</a> and <a href="https://www.jetbrains.com/idea/">IntelliJ</a> to load the
project correctly, and launch the debugger from <a href="https://www.jetbrains.com/idea/">IntelliJ</a>.
</p>

<p>
No more.  The pain is gone, forced on by fighting <a href="https://www.jetbrains.com/idea/">IntelliJ</a> to load one too many
times.
</p>

<p>
tl;dr: self-inflicted pain is a strange way to deeply learn.
</p>

</div>

<p>
Before programming took over, I wanted to be a security expert/red
team/hacker.  This lead me to some strange places, one of which is the desire
to <del>put hot glue in my Ethernet ports and disable WiFi</del> have strict firewall
rules.  Specifically, default policy drop on all tables, including outbound.
</p>

<p>
As a result of my current research, I've been predominately in <a href="https://www.oracle.com/java/">Java</a> land.  I'm
using <a href="https://www.gnu.org/software/emacs/">Emacs</a> with <a href="https://langserver.org/">LSP</a> as my full-time <a href="https://www.oracle.com/java/">Java</a> editor and it has not been without
issue.  Although, it's been far more comfortable and reliable than the other
two big IDE choices that exist (likely as a result of recursive suffering).
That said, debugging <a href="https://www.oracle.com/java/">Java</a> programs has been a non-starter with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://microsoft.github.io/debug-adapter-protocol/">DAP</a>.
I could not explain why it would take more than 2 minutes to launch and connect
to a debugging session facilitated by <a href="https://microsoft.github.io/debug-adapter-protocol/">DAP</a>.
</p>

<div id="outline-container-org7c354f8" class="outline-2">
<h2 id="org7c354f8">Confluence of Issues</h2>
<div class="outline-text-2" id="text-org7c354f8">
<p>
Before using <a href="https://langserver.org/">LSP</a>, I configured <a href="https://github.com/mpdel/mpdel">mpdel</a> to control mpd from within <a href="https://www.gnu.org/software/emacs/">Emacs</a>.  It was
fantastic except that initial connection.  The connection would take several
minutes and lockup <a href="https://www.gnu.org/software/emacs/">Emacs</a> entirely.  I submitted a <a href="https://github.com/mpdel/libmpdel/commit/124e72daf489fd46217236d2ada5c6963eb2cb65">patch</a> to <a href="https://github.com/mpdel/libmpdel">libmdel</a> to always
use the <a href="https://www.gnu.org/software/emacs/">Emacs</a> <code>make-network-process</code> (implemented in C) over <code>open-network-stream</code>
(implemented in Elisp).  I had concluded that the performance issues were
entirely Elisp's fault, and therefore moved to replace it.  It worked.  But I
couldn't exactly explain why other than the intuition that C is faster than
Elisp (likely a sound assumption, but is not necessarily the culprit of bad
performance).
</p>

<p>
Needing to debug some code and unable to use <a href="https://www.jetbrains.com/idea/">IntelliJ</a>, I reluctantly attempted
to use <code>dap-java-debug-test</code>.  It was slow.  Each iteration of stopping and
starting causing more delays and fragmented thinking.  It would eventually
work, but it was impeding progress.
</p>

<p>
To resolve the issue, I thought perhaps, I needed to patch <a href="https://langserver.org/">LSP</a> and/or <a href="https://microsoft.github.io/debug-adapter-protocol/">DAP</a> to
use <code>make-network-process</code> over their current usage of <code>open-network-stream</code>
similar to <a href="https://github.com/mpdel/libmpdel">libmpdel</a>.  Then, I re-read my commit message for <a href="https://github.com/mpdel/libmpdel/commit/124e72daf489fd46217236d2ada5c6963eb2cb65">libmpdel</a>.
</p>

<blockquote>
<p>
Always use make-network-process
</p>

<p>
When making a connection to MPD, whether via local UNIX socket, or TCP
stream, `make-network-process` tends to be faster at establishing the
connection.  In my limited testing, `make-network-process` tends to be
dramatically faster than the `open-network-stream` function.  Of course,
without passing `:family 'ipv4` to `make-network-process`, the two
functions exhibit similar performance, so it's not as simple as "one is
written in C and the other is written in ELisp."
</p>
</blockquote>

<p>
There it was, staring me in the face.  <code>:family 'ipv4</code>.  The issue isn't C versus
Elisp, as noted, it's the family of the connection.
</p>
</div>
</div>

<div id="outline-container-org434eed0" class="outline-2">
<h2 id="org434eed0">IPv6+4</h2>
<div class="outline-text-2" id="text-org434eed0">
<p>
Having not been bitten by the IPv6 shark in a while, I've neglected any attempt
to disable it or fiddle with it.  It simply hasn't been relevant to my regular
development activities.  But re-reading the commit message reminded me, the
issue may be a result of IPv6 being enabled on my machine.  I first thought to
disable IPv6 to see if that would resolve the issue.  But ultimately I had
rechecked my firewall rules instead.
</p>

<p>
In the output chain, there was a lonely IPv4 rule:
</p>

<div class="org-src-container">
<pre class="src src-nft">ip daddr 127.0.0.0/8 counter accept
</pre>
</div>

<p>
Since the default policy is to drop, any local bound IPv6 traffic was being
dropped.
</p>

<p>
Easy enough, insert a new rule:
</p>

<div class="org-src-container">
<pre class="src src-nft">ip6 daddr ::1 counter accept
</pre>
</div>

<p>
<a href="https://www.gnu.org/software/emacs/">Emacs</a>, <a href="https://microsoft.github.io/debug-adapter-protocol/">DAP</a>, and <a href="https://www.oracle.com/java/">Java</a> debugging worked instantly.  No more waiting for
everything to timeout and fall back to previous versions.  No more locked up
<a href="https://www.gnu.org/software/emacs/">Emacs</a> and fragmented thoughts.  Debugging in <a href="https://www.gnu.org/software/emacs/">Emacs</a> was as fast, if not faster,
than <a href="https://www.jetbrains.com/idea/">IntelliJ</a>.
</p>
</div>
</div>

<div id="outline-container-org9e0a6da" class="outline-2">
<h2 id="org9e0a6da">TL;DR:</h2>
<div class="outline-text-2" id="text-org9e0a6da">
<p>
Debugging <a href="https://www.oracle.com/java/">Java</a> programs in <a href="https://www.gnu.org/software/emacs/">Emacs</a> using <a href="https://microsoft.github.io/debug-adapter-protocol/">DAP</a> was problematic because of firewall
rules I imposed onto myself.  Allowing the appropriate traffic vanquished the
problem.  Security is hard and it is far too easy to simply flush tables and
move on.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2023 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
